Revit 2027 API
ImportIFCOptions Methods
The ImportIFCOptions type exposes the following members.
Methods
Name | Description
Dispose
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetImportIFCOptions |  Returns the current Revit instance's ImportIFCOptions.
GetType | Gets the Type of the current instance.
(Inherited from Object)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
ImportIFCOptions Class
Autodesk.Revit.DB Namespace